#!/usr/bin/env python3
#-*- coding: utf-8 -*-
import requests, re , colorama
colorama.init()
print("""
\033[1;31m\033[1;37m
 ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 ★★★★★★★★★★★★★★★★★★★中国黑客组织-黑客入侵摄像头工具（黑客渗透测试2022）★★★★★★★★★★★★★★★★★★★★★★★★★★
                            Chinese hackers Organization 
 ★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★                                                                                         
 ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
\033[1;31m                          ᴄʜɪɴᴀʜᴀᴄᴋᴇʀ2022                                                            

 \033[1;31m1) \033[1;37m美国                       \033[1;31m31) \033[1;37m墨西哥              \033[1;31m61) \033[1;37m摩尔多瓦
 \033[1;31m2) \033[1;37m日本                       \033[1;31m32) \033[1;37m芬兰                \033[1;31m62) \033[1;37m尼加拉瓜
 \033[1;31m3) \033[1;37m意大利                     \033[1;31m33) \033[1;37m中国                \033[1;31m63) \033[1;37m马耳他
 \033[1;31m4) \033[1;37m韩国                       \033[1;31m34) \033[1;37m智利                \033[1;31m64) \033[1;37m特立尼达和多巴哥
 \033[1;31m5) \033[1;37m法国                       \033[1;31m35) \033[1;37m南非                \033[1;31m65) \033[1;37m沙特阿拉伯南部
 \033[1;31m6) \033[1;37m德国                       \033[1;31m36) \033[1;37m斯洛伐克            \033[1;31m66) \033[1;37m克罗地亚
 \033[1;31m7) \033[1;37m台湾                       \033[1;31m37) \033[1;37m匈牙利              \033[1;31m67) \033[1;37m塞浦路斯
 \033[1;31m8) \033[1;37m俄罗斯联邦                 \033[1;31m38) \033[1;37m爱尔兰              \033[1;31m68) \033[1;37m巴基斯坦
 \033[1;31m9) \033[1;37m英国                       \033[1;31m39) \033[1;37m埃及                \033[1;31m69) \033[1;37m阿拉伯联合酋长国
\033[1;31m10) \033[1;37m荷兰                       \033[1;31m40) \033[1;37m泰国                \033[1;31m70) \033[1;37m哈萨克斯坦
\033[1;31m11) \033[1;37m捷克                       \033[1;31m41) \033[1;37m乌克兰              \033[1;31m71) \033[1;37m科威特
\033[1;31m12) \033[1;37m土耳其                     \033[1;31m42) \033[1;37m塞尔维亚            \033[1;31m72) \033[1;37m委内瑞拉
\033[1;31m13) \033[1;37m奥地利                     \033[1;31m43) \033[1;37m香港                \033[1;31m73) \033[1;37m乔治亚
\033[1;31m14) \033[1;37m瑞士                       \033[1;31m44) \033[1;37m希腊                \033[1;31m74) \033[1;37m黑山
\033[1;31m15) \033[1;37m西班牙                     \033[1;31m45) \033[1;37m葡萄牙              \033[1;31m75) \033[1;37m萨尔瓦多
\033[1;31m16) \033[1;37m加拿大                     \033[1;31m46) \033[1;37m拉脱维亚            \033[1;31m76) \033[1;37m卢森堡
\033[1;31m17) \033[1;37m瑞典                       \033[1;31m47) \033[1;37m新加坡              \033[1;31m77) \033[1;37m库拉曹
\033[1;31m18) \033[1;37m以色列                     \033[1;31m48) \033[1;37m冰岛                \033[1;31m78) \033[1;37m波多黎各
\033[1;31m19) \033[1;37m伊朗                       \033[1;31m49) \033[1;37m马来西亚            \033[1;31m79) \033[1;37m哥斯达黎加
\033[1;31m20) \033[1;37m波兰                       \033[1;31m50) \033[1;37m哥伦比亚            \033[1;31m80) \033[1;37m白俄罗斯
\033[1;31m21) \033[1;37m印度                       \033[1;31m51) \033[1;37m突尼斯              \033[1;31m81) \033[1;37m阿尔巴尼亚
\033[1;31m22) \033[1;37m挪威                       \033[1;31m52) \033[1;37m爱沙尼亚            \033[1;31m82) \033[1;37m列支敦士登
\033[1;31m23) \033[1;37m罗马尼亚                   \033[1;31m53) \033[1;37m多米尼加共和国      \033[1;31m83) \033[1;37m波斯尼亚和黑塞哥维那
\033[1;31m24) \033[1;37m越南                       \033[1;31m54) \033[1;37m爱阿尼亚            \033[1;31m84) \033[1;37m巴拉圭
\033[1;31m25) \033[1;37m比利时                     \033[1;31m55) \033[1;37m厄瓜多尔            \033[1;31m85) \033[1;37m菲律宾
\033[1;31m26) \033[1;37m巴西                       \033[1;31m56) \033[1;37m立陶宛              \033[1;31m86) \033[1;37m法罗群岛
\033[1;31m27) \033[1;37m保加利亚                   \033[1;31m57) \033[1;37m巴勒斯坦的          \033[1;31m87) \033[1;37m危地马拉
\033[1;31m28) \033[1;37m印度尼西亚                 \033[1;31m58) \033[1;37m新西兰              \033[1;31m88) \033[1;37m尼泊尔
\033[1;31m29) \033[1;37m丹麦                       \033[1;31m59) \033[1;37m邦拉代              \033[1;31m89) \033[1;37m秘鲁
\033[1;31m30) \033[1;37m阿根廷                     \033[1;31m60) \033[1;37m巴拿马              \033[1;31m90) \033[1;37m乌拉圭
                                                       \033[1;31m91) \033[1;37m额外的哦哈哈
""")

try:
    print()
    countries = ["US", "JP", "IT", "KR", "FR", "DE", "TW", "RU", "GB", "NL",
                 "CZ", "TR", "AT", "CH", "ES", "CA", "SE", "IL", "PL", "IR",
                 "NO", "RO", "IN", "VN", "BE", "BR", "BG", "ID", "DK", "AR",
                 "MX", "FI", "CN", "CL", "ZA", "SK", "HU", "IE", "EG", "TH",
                 "UA", "RS", "HK", "GR", "PT", "LV", "SG", "IS", "MY", "CO",
                 "TN", "EE", "DO", "SI", "EC", "LT", "PS", "NZ", "BD", "PA",
                 "MD", "NI", "MT", "IT", "SA", "HR", "CY", "PK", "AE", "KZ",
                 "KW", "VE", "GE", "ME", "SV", "LU", "CW", "PR", "CR", "BY",
                 "AL", "LI", "BA", "PY", "PH", "FO", "GT", "NP", "PE", "UY",
                 "-"]
    headers = {"User-Agent": "Mozilla/5.0 (X11; Linux i686; rv:68.0) Gecko/20100101 Firefox/68.0"}

    num = int(input("入侵选项 : "))
    if num not in range(1, 91+1):
        raise IndexError

    country = countries[num-1]
    res = requests.get(
        f"https://www.insecam.org/en/bycountry/{country}", headers=headers
    )
    last_page = re.findall(r'pagenavigator\("\?page=", (\d+)', res.text)[0]

    for page in range(int(last_page)):
        res = requests.get(
            f"https://www.insecam.org/en/bycountry/{country}/?page={page}",
            headers=headers
        )
        find_ip = re.findall(r"http://\d+.\d+.\d+.\d+:\d+", res.text)
        for ip in find_ip:
            print("\033[1;31m", ip)
except:
    pass
finally:
    print("\033[1;37m")
    exit()
